src/cf/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНоменклатураГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГрузов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Comment>Класс груза</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемператураДо</Name>
					<Comment>Значение конца диапазона температуры в градусах цельсия хранения/транспортировки груза</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемператураОт</Name>
					<Comment>Значение начала диапазона температуры в градусах цельсия хранения/транспортировки груза</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМасло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеДанныеСкрыты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удаление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/уатЗащищенныеФункцииКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Защищенные функции клиенсткого контекста.
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыФункцииОткрытияОбъектов

// Процедура проверки защиты при событии "При открытии" формы списка справочника 
//
Процедура уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметры) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента справочника
//
Процедура уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка документа
//
Процедура уатДокументФормаСпискаПриОткрытии(Отказ, Форма, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Форма, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента документа
//
Процедура уатДокументФормаЭлементаПриОткрытии(Отказ, Форма, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Форма, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы обработки
//
Процедура уатОбработкаФормаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
	// Фиксация замера производительности
	ИмяФормы = Неопределено;
	ДопПараметры.Свойство("ИмяФормы",ИмяФормы);
	Если ИмяФормы <> Неопределено Тогда
		ИмяКлючевойОперации = "ОткрытиеФормы." + уатОбщегоНазначенияКлиентСервер.ОбрезатьИмяФормы(ИмяФормы);
		ОценкаПроизводительностиКлиент.ЗамерВремени(ИмяКлючевойОперации);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка регистра
//
Процедура уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииРаботыСГСМ

// Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ВыбратьГСМ(ГруппаГСМ = Неопределено, ДополнительныеПараметры = Неопределено, ПроцедураОписаниеОповещения = Неопределено) ЭКСПОРТ
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГСМ", Истина);
	
	Если ЗначениеЗаполнено(ГруппаГСМ) Тогда
		ПараметрыФормы.Вставить("ГруппаГСМ", ГруппаГСМ);
	Иначе
		ПараметрыФормы.Вставить("ГруппаГСМ", ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	КонецЕсли;
	
	КлючУникальности = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ЗначениеГСМДоИзменения") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.ЗначениеГСМДоИзменения);
		ИначеЕсли ДополнительныеПараметры.Свойство("НачальноеЗначениеВыбора") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.НачальноеЗначениеВыбора);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("ТолькоТЖсУчетомОстатка") И ДополнительныеПараметры.ТолькоТЖсУчетомОстатка Тогда
			ПараметрыФормы.Вставить("ТолькоТЖсУчетомОстатка", ДополнительныеПараметры.ТолькоТЖсУчетомОстатка);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("КлючУникальности") Тогда
			КлючУникальности = ДополнительныеПараметры.КлючУникальности;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("Отбор") Тогда 
			ПараметрыФормы.Вставить("Отбор", ДополнительныеПараметры.Отбор);
		КонецЕсли;
	КонецЕсли;
		
	ОткрытьФорму("РегистрСведений.уатНоменклатураГСМ.ФормаСписка", ПараметрыФормы,,КлючУникальности,,, ПроцедураОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатВыбратьГСМ 

// Возвращает форму списка ГСМ
Процедура СписокГСМдляТС(Организация, ТС, ГруппаГСМ, БезАналогов = Ложь, ТолькоТЖсУчетомОстатка = Ложь, ПроцедураОписаниеОповещения = Неопределено, ВводОстатков = Ложь) ЭКСПОРТ
	ПараметрыФормы = Новый Структура("ГруппаГСМ, ТС, Организация, БезАналогов, ТолькоТЖсУчетомОстатка", ГруппаГСМ, ТС, Организация, БезАналогов, ТолькоТЖсУчетомОстатка);
	Если ВводОстатков Тогда
		ПараметрыФормы.Вставить("ВводОстатков", Истина);
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.уатСписокГСМ", ПараметрыФормы,,,,, ПроцедураОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатСписокГСМдляТС

#КонецОбласти

#Область ПроцедурыФункцииРаботыСГрузами

// Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ДиалогВыбораГруза(Элемент, Номенклатура, ВладелецФормы, СтандартнаяОбработка, ДопПараметры = Неопределено) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, Номенклатура);
	// установим необходимые отборы
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ПараметрыОтбора") Тогда
		ПараметрыФормы.Вставить("Отбор", ДопПараметры.ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.уатНоменклатураГрузов.Форма.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
КонецПроцедуры // уатДиалогВыбораГруза       

#КонецОбласти

#Область ПроцедурыФункцииРаботыССотрудниками

// Выбор сотрудника/водителя из спр. Сотрудники с помощью форм обработки уатСотрудники
// Параметры:
//	- Элемент, связанный с сотрудником
//	- ТекСотрудник, ссылка на данные сотрудника
//	- ПараметрыОтбора, структура отбора
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ДиалогВыбораСотрудника(Элемент, ТекСотрудник, ПараметрыОтбора, СтандартнаяОбработка) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, ТекСотрудник);
	// установим необходимые отборы
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСписка", ПараметрыФормы, Элемент);
КонецПроцедуры

// Открытие формы элемента сотрудника/водителя из спр. Сотрудники с помощью формы обработки уатСотрудники
// Параметры:
//	- ТекСотрудник, ссылка на данные сотрудника
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ОткрытьФормуСотрудника(ТекСотрудник, СтандартнаяОбработка) ЭКСПОРТ
	Если НЕ ЗначениеЗаполнено(ТекСотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", ТекСотрудник);
	Если ТипЗнч(ТекСотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	ИначеЕсли ТипЗнч(ТекСотрудник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Проверка_ИТС_Отраслевой

Функция ИТСОтраслевой_ПроверкаДоступностиСервисов() Экспорт
	флОК = уатЗащищенныеФункцииСервер.ЕстьПодпискаИТСОтраслевой();
	Если НЕ флОК Тогда
		ОткрытьФорму("ОбщаяФорма.уатПодпискаИТСОтраслевой");
	КонецЕсли;
	
	Возврат флОК;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция выполняет сложение времени представленного в разных типах
//
// Параметры:
//  Дата1         - первое время (чисто или дата)
//  Дата2         - второе время (чисто или дата)
//
// Возвращаемое значение:
//  Результат суммирования
//
Функция СложитьВремя(Знач Время1, Знач Время2) Экспорт
	
	Если ТипЗнч(Время1) = Тип("Число") И ТипЗнч(Время2) = Тип("Число") Тогда
		Время1Сек = Цел(Время1) * 60 * 60 + ((Время1 - Цел(Время1)) * 100 * 60);
		Время2Сек = Цел(Время2) * 60 * 60 + ((Время2 - Цел(Время2)) * 100 * 60);
		ВремяРезМин = (Время1Сек + Время2Сек) / 60;
		ВремяРезЧас = Цел(ВремяРезМин / 60);
		ВремяДоп = (ВремяРезМин - ВремяРезЧас * 60) / 100;
		
		Возврат ВремяРезЧас + ВремяДоп;
		
	ИначеЕсли ТипЗнч(Время1) = Тип("Дата") И ТипЗнч(Время2) = Тип("Дата") Тогда
		
		Возврат Время1 + Час(Время2) * 60 * 60 + Минута(Время2) * 60 + Секунда(Время2);
		
	Иначе
		Если ТипЗнч(Время1) = Тип("Число") Тогда
			мВремя1 = Время2;
			мВремя2 = Время1;
		Иначе
			мВремя1 = Время1;
			мВремя2 = Время2;
		КонецЕсли;
		
		мВремя = дата('00010101010101');
		МВремя = мВремя1 + Цел(мВремя2) * 60 * 60 + (Время2 - Цел(Время2)) * 100 * 60;
		
		Если ТипЗнч(Время1) = Тип("Число") Тогда
			Возврат Час(мВремя) + Минута(мВремя) / 100;
			
		Иначе
			Возврат мВремя;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Общая процедура проверки защиты при событии "При открытии" всех форм
//
// Параметры:
//  Отказ		 - 	 - 
//  Форма		 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура уатФормаПриОткрытии(Отказ, Форма, ДопПараметры)
	
	Если ДопПараметры = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.уатИнициализацияСеансаКлиент(ДопПараметры);
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("Отказ") И ДопПараметры.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Форма = Неопределено Тогда
		ФормаЭлементЗаписать = Форма.Элементы.Найти("ФормаЗаписать");
		Если Не ФормаЭлементЗаписать = Неопределено Тогда 
			ФормаЭлементЗаписать.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		ФормаЭлементПровести = Форма.Элементы.Найти("ФормаПровести");
		Если Не ФормаЭлементПровести = Неопределено Тогда 
			ФормаЭлементПровести.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		ФормаЭлементСоздатьНаОсновании = Форма.Элементы.Найти("ФормаСоздатьНаОсновании");
		Если Не ФормаЭлементСоздатьНаОсновании = Неопределено Тогда 
			ФормаЭлементСоздатьНаОсновании.Отображение = ОтображениеКнопки.Картинка;
			ФормаЭлементСоздатьНаОсновании.Картинка = БиблиотекаКартинок.уатПодменюВводаНаОсновании;
		КонецЕсли;
		
		Если ТипЗнч(ПользователиКлиент.АвторизованныйПользователь()) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
			ФормаЭлементИнтеграцияСДокументооборотом = Форма.Элементы.Найти("ПодменюСоздатьНаОснованииОбычное__ИнтеграцияС1СДокументооборотНачатьОбработку");
			Если Не ФормаЭлементИнтеграцияСДокументооборотом = Неопределено Тогда
				ФормаЭлементИнтеграцияСДокументооборотом.Видимость = Ложь;
			КонецЕсли;
			ФормаЭлементИнтеграцияСДокументооборотом = Форма.Элементы.Найти("ФормаИнтеграцияС1СДокументооборотНачатьОбработку");
			Если Не ФормаЭлементИнтеграцияСДокументооборотом = Неопределено Тогда
				ФормаЭлементИнтеграцияСДокументооборотом.Видимость = Ложь;
			КонецЕсли;
			ФормаЭлементИнтеграцияСДокументооборотом = Форма.Элементы.Найти("ФормаОбщаяКомандаИнтеграцияС1СДокументооборотНачатьОбработку");
			Если Не ФормаЭлементИнтеграцияСДокументооборотом = Неопределено Тогда
				ФормаЭлементИнтеграцияСДокументооборотом.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
